transaction-manager/transaction-manager-component-test/src/test/resources/data/response/request-payment/fam_success_response.json

{
  "transactionMessage": {
    "header": {
      "type": "REQUEST_PAYMENT_BY_CARD",
      "url": ""
    },
    "messages": [
      {
        "type": "CAAA001",
        "message": {
          "CARD_HOLDER_CITY": "test",
          "CARD_HOLDER_COUNTRY": "test",
          "CARD_HOLDER_ADDRESS1": "test",
          "CARD_HOLDER_POST_CODE": "test",
          "TRANSACTION_CURRENCY_CODE": "GBP",
          "TOTAL_AMOUNT": 40.28,
          "EXPIRY_MONTH": "11",
          "EXPIRY_YEAR": "2020",
          "CARD_HOLDER_NAME": "test",
          "PAN_NUMBER": "424242******4242",
          "START_MONTH": "12",
          "START_YEAR": "2019",
          "REFERENCE": "rrr",
          "PROCESSOR_AGREED_FEE_AMOUNT": 2,
          "PROCESSOR_AGREED_FEE_AMOUNT_CURRENCY": "GBP"
        },
        "additionalInfo": {
          "TRANSACTION_ID": "7759595681"
        }
      },
      {
        "type": "CAAA002",
        "message": {
          "PAYMENT_STATUS": "AUTHORISED"
        },
        "additionalInfo": {
          "TRANSACTION_ID": "7759595681",
          "PROCESSOR_ACTUAL_FEE_AMOUNT": 1.37,
          "PROCESSOR_ACTUAL_FEE_AMOUNT_CURRENCY": "gbp",
          "POSTING_AMOUNT": 38.91,
          "POSTING_AMOUNT_CURRENCY": "gbp"
        }
      },
      {
        "type": "POSTING_AMOUNT",
        "message": {
          "POSTING_AMOUNT": 38.91,
          "POSTING_AMOUNT_CURRENCY": "GBP"
        },
        "additionalInfo": {}
      },
      {
        "type": "PROCESSOR_ACTUAL_FEE",
        "message": {
          "PROCESSOR_ACTUAL_FEE_AMOUNT_CURRENCY": "GBP",
          "PROCESSOR_ACTUAL_FEE_AMOUNT": 1.37
        },
        "additionalInfo": {}
      },
      {
        "type": "PROCESSOR_AGREED_FEE",
        "message": {
          "PROCESSOR_AGREED_FEE_AMOUNT_CURRENCY": "GBP",
          "PROCESSOR_AGREED_FEE_AMOUNT": 2
        },
        "additionalInfo": {}
      }
    ],
    "additionalInfo": {
      "REQUEST_ID": "ecfc6c00-3cab-11e8-98d3-7f99b9a03939",
      "TRANSACTION_CORRELATION_ID": "3615800015"
    }
  }
}